Terraform Plan:

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.user_data will be created
  + resource "local_file" "user_data" {
      + content              = jsonencode(
            {
              + admins = {
                  + gary  = "gary@gmail.com"
                  + wendy = "wendy@gmail.com"
                }
              + users  = {
                  + bill  = "bill@gmail.com"
                  + jenny = "jenny@gmail.com"
                }
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./user_data.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Plan saved to GH artifacts.